// Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше, либо равна 3 символам.
// Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма.
// При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

//Решение
// Задаем массив
string [] array = {"hello", "world", ":-)", "bye", ";)", "summer"};
// Согласно условию задачи вводим длину строки меньшую или равную 3м.
int length_mean = 3;
